




//Функция ферма
// Функционал :
// 1) Просмотреть все категории =>
// выбрать категорию => все животные
// данной категории
// 2) Все животные
// 3) Добавить животное
// 4) Удалить животное
// 5) Закончить работу с программой

// 1) Создайте три объекта :
// птица , скот , домашние животные .
// В объектах ключами и айДи , категория
// - значение будет массив
// 2) При помощи функцииФермы мы
// предоставляем юзеру возможность
// производить новых животных в
// массивах , животные появляются в виде
// объектов с ключами : имя , возраст ,
// издаваемый звук , издать звук
// 3) В массиве не должно быть животных
// с одинаковыми именами
// 4) Животных можно сортировать по
// возрасту , можно фильтровать по
// категории
// 5) Можно убирать и добавлять новых
// животных